# AreElementsValidIntersectingReferences Method (ICollection(ElementId))

---
C#Visual BasicVisual C++
Revit 2024 API
---
PartMakerMethodToDivideVolumes..::..AreElementsValidIntersectingReferences Method (ICollection<(Of <(<'ElementId>)>)>)
PartMakerMethodToDivideVolumes Class See Also
---
Identifies if provided members are valid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool AreElementsValidIntersectingReferences(
	ICollection<ElementId> elementIds
)
```

Visual Basic
---
```text
Public Function AreElementsValidIntersectingReferences ( _
	elementIds As ICollection(Of ElementId) _
) As Boolean
```

Visual C++
---
```text
public:
bool AreElementsValidIntersectingReferences(
	ICollection<ElementId^>^ elementIds
)
```

# ### Parameters
elementIds
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> Element ids to be tested for validity for intersecting references.
# ### Return Value
True if all references are valid, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PartMakerMethodToDivideVolumes Class
AreElementsValidIntersectingReferences Overload
Autodesk.Revit.DB Namespace